## 1. 판다스(Pandas) 라이브러리 사용하기

### 1) 판다스 데이터프레임 살펴보기

In [3]:
import pandas as pd

In [28]:
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
births = [968, 155, 77, 578, 973]
custom = [1, 5, 25, 13, 23232]
BabyDataSet = list(zip(names,births))
df = pd.DataFrame(data = BabyDataSet, columns = ['Names', 'Births'])

In [29]:
df.head()

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [6]:
df.dtypes

Names     object
Births     int64
dtype: object

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.columns

Index(['Names', 'Births'], dtype='object')

-----
### 2) 데이터프레임의 열과 행 다루기

In [9]:
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [10]:
df[0:3]

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77

-----
### 3) 데이터프레임의 필터링과 연산

In [11]:
df[df['Births'] > 100]

     Names  Births
0      Bob     968
1  Jessica     155
3     John     578
4      Mel     973

In [12]:
df.mean()

Births    550.2
dtype: float64

In [13]:
df.describe()

           Births
count    5.000000
mean   550.200000
std    428.424672
min     77.000000
25%    155.000000
50%    578.000000
75%    968.000000
max    973.000000

-----
### 4) 데이터프레임의 하위 객체인 시리즈(Series) 객체

In [14]:
a = [1, 7, 2]

series1 = pd.Series(a)

In [15]:
series1

0    1
1    7
2    2
dtype: int64

In [16]:
series1[0]

1

In [19]:
series1[0:2]

0    1
1    7
dtype: int64

In [17]:
series1.values[0]

1

In [22]:
series1.values[0:2]

array([1, 7])

In [18]:
series1.index[0]

0

In [21]:
series1.index.values

array([0, 1, 2])

-----
### 5) Read File to Dataframe

In [24]:
df = pd.read_csv("../../dataset/chipotle.tsv", sep='\t')

In [25]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [26]:
df.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB